cyruscook/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-8.1.0/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################

Inkplate2.name=Soldered Inkplate2

Inkplate2.bootloader.tool=esptool_py
Inkplate2.bootloader.tool.default=esptool_py

Inkplate2.upload.tool=esptool_py
Inkplate2.upload.tool.default=esptool_py
Inkplate2.upload.tool.network=esp_ota

Inkplate2.upload.maximum_size=1310720
Inkplate2.upload.maximum_data_size=327680
Inkplate2.upload.flags=
Inkplate2.upload.extra_flags=

Inkplate2.serial.disableDTR=true
Inkplate2.serial.disableRTS=true

Inkplate2.build.tarch=xtensa
Inkplate2.build.bootloader_addr=0x1000
Inkplate2.build.target=esp32
Inkplate2.build.mcu=esp32
Inkplate2.build.core=esp32
Inkplate2.build.variant=Inkplate
Inkplate2.build.board=INKPLATE2

Inkplate2.build.f_cpu=240000000L
Inkplate2.build.flash_size=4MB
Inkplate2.build.flash_freq=80m
Inkplate2.build.flash_mode=qio
Inkplate2.build.boot=dio
Inkplate2.build.partitions=default
Inkplate2.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate2.build.extra_libs=

Inkplate2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate2.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate2.menu.PartitionScheme.default.build.partitions=default
Inkplate2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate2.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate2.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate2.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate2.menu.FlashMode.qio=QIO
Inkplate2.menu.FlashMode.qio.build.flash_mode=dio
Inkplate2.menu.FlashMode.qio.build.boot=qio
Inkplate2.menu.FlashMode.dio=DIO
Inkplate2.menu.FlashMode.dio.build.flash_mode=dio
Inkplate2.menu.FlashMode.dio.build.boot=dio
Inkplate2.menu.FlashMode.qout=QOUT
Inkplate2.menu.FlashMode.qout.build.flash_mode=dout
Inkplate2.menu.FlashMode.qout.build.boot=qout
Inkplate2.menu.FlashMode.dout=DOUT
Inkplate2.menu.FlashMode.dout.build.flash_mode=dout
Inkplate2.menu.FlashMode.dout.build.boot=dout

Inkplate2.menu.FlashFreq.80=80MHz
Inkplate2.menu.FlashFreq.80.build.flash_freq=80m
Inkplate2.menu.FlashFreq.40=40MHz
Inkplate2.menu.FlashFreq.40.build.flash_freq=40m

Inkplate2.menu.UploadSpeed.921600=921600
Inkplate2.menu.UploadSpeed.921600.upload.speed=921600
Inkplate2.menu.UploadSpeed.115200=115200
Inkplate2.menu.UploadSpeed.115200.upload.speed=115200
Inkplate2.menu.UploadSpeed.256000.windows=256000
Inkplate2.menu.UploadSpeed.256000.upload.speed=256000
Inkplate2.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate2.menu.UploadSpeed.230400=230400
Inkplate2.menu.UploadSpeed.230400.upload.speed=230400
Inkplate2.menu.UploadSpeed.460800.linux=460800
Inkplate2.menu.UploadSpeed.460800.macosx=460800
Inkplate2.menu.UploadSpeed.460800.upload.speed=460800
Inkplate2.menu.UploadSpeed.512000.windows=512000
Inkplate2.menu.UploadSpeed.512000.upload.speed=512000

Inkplate2.menu.DebugLevel.none=None
Inkplate2.menu.DebugLevel.none.build.code_debug=0
Inkplate2.menu.DebugLevel.error=Error
Inkplate2.menu.DebugLevel.error.build.code_debug=1
Inkplate2.menu.DebugLevel.warn=Warn
Inkplate2.menu.DebugLevel.warn.build.code_debug=2
Inkplate2.menu.DebugLevel.info=Info
Inkplate2.menu.DebugLevel.info.build.code_debug=3
Inkplate2.menu.DebugLevel.debug=Debug
Inkplate2.menu.DebugLevel.debug.build.code_debug=4
Inkplate2.menu.DebugLevel.verbose=Verbose
Inkplate2.menu.DebugLevel.verbose.build.code_debug=5

Inkplate2.menu.EraseFlash.none=Disabled
Inkplate2.menu.EraseFlash.none.upload.erase_cmd=
Inkplate2.menu.EraseFlash.all=Enabled
Inkplate2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Inkplate4.name=Soldered Inkplate4

Inkplate4.bootloader.tool=esptool_py
Inkplate4.bootloader.tool.default=esptool_py

Inkplate4.upload.tool=esptool_py
Inkplate4.upload.tool.default=esptool_py
Inkplate4.upload.tool.network=esp_ota

