cyruscook/Dasduino-Board-Definitions-for-Arduino-IDE/Inkplate_core-8.1.0/boards.txt
Inkplate4.upload.maximum_size=1310720
Inkplate4.upload.maximum_data_size=327680
Inkplate4.upload.flags=
Inkplate4.upload.extra_flags=

Inkplate4.serial.disableDTR=true
Inkplate4.serial.disableRTS=true

Inkplate4.build.tarch=xtensa
Inkplate4.build.bootloader_addr=0x1000
Inkplate4.build.target=esp32
Inkplate4.build.mcu=esp32
Inkplate4.build.core=esp32
Inkplate4.build.variant=Inkplate
Inkplate4.build.board=INKPLATE4

Inkplate4.build.f_cpu=240000000L
Inkplate4.build.flash_size=4MB
Inkplate4.build.flash_freq=80m
Inkplate4.build.flash_mode=qio
Inkplate4.build.boot=dio
Inkplate4.build.partitions=default
Inkplate4.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate4.build.extra_libs=

Inkplate4.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate4.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate4.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate4.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate4.menu.PartitionScheme.default.build.partitions=default
Inkplate4.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate4.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate4.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate4.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate4.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate4.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate4.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate4.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate4.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate4.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate4.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate4.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate4.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate4.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate4.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate4.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate4.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate4.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate4.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate4.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate4.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate4.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate4.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate4.menu.FlashMode.qio=QIO
Inkplate4.menu.FlashMode.qio.build.flash_mode=dio
Inkplate4.menu.FlashMode.qio.build.boot=qio
Inkplate4.menu.FlashMode.dio=DIO
Inkplate4.menu.FlashMode.dio.build.flash_mode=dio
Inkplate4.menu.FlashMode.dio.build.boot=dio
Inkplate4.menu.FlashMode.qout=QOUT
Inkplate4.menu.FlashMode.qout.build.flash_mode=dout
Inkplate4.menu.FlashMode.qout.build.boot=qout
Inkplate4.menu.FlashMode.dout=DOUT
Inkplate4.menu.FlashMode.dout.build.flash_mode=dout
Inkplate4.menu.FlashMode.dout.build.boot=dout

Inkplate4.menu.FlashFreq.80=80MHz
Inkplate4.menu.FlashFreq.80.build.flash_freq=80m
Inkplate4.menu.FlashFreq.40=40MHz
Inkplate4.menu.FlashFreq.40.build.flash_freq=40m

Inkplate4.menu.UploadSpeed.921600=921600
Inkplate4.menu.UploadSpeed.921600.upload.speed=921600
Inkplate4.menu.UploadSpeed.115200=115200
Inkplate4.menu.UploadSpeed.115200.upload.speed=115200
Inkplate4.menu.UploadSpeed.256000.windows=256000
Inkplate4.menu.UploadSpeed.256000.upload.speed=256000
Inkplate4.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate4.menu.UploadSpeed.230400=230400
Inkplate4.menu.UploadSpeed.230400.upload.speed=230400
Inkplate4.menu.UploadSpeed.460800.linux=460800
Inkplate4.menu.UploadSpeed.460800.macosx=460800
Inkplate4.menu.UploadSpeed.460800.upload.speed=460800
Inkplate4.menu.UploadSpeed.512000.windows=512000
Inkplate4.menu.UploadSpeed.512000.upload.speed=512000

Inkplate4.menu.DebugLevel.none=None
Inkplate4.menu.DebugLevel.none.build.code_debug=0
Inkplate4.menu.DebugLevel.error=Error
Inkplate4.menu.DebugLevel.error.build.code_debug=1
Inkplate4.menu.DebugLevel.warn=Warn
Inkplate4.menu.DebugLevel.warn.build.code_debug=2
Inkplate4.menu.DebugLevel.info=Info
Inkplate4.menu.DebugLevel.info.build.code_debug=3
Inkplate4.menu.DebugLevel.debug=Debug
Inkplate4.menu.DebugLevel.debug.build.code_debug=4
Inkplate4.menu.DebugLevel.verbose=Verbose
Inkplate4.menu.DebugLevel.verbose.build.code_debug=5

Inkplate4.menu.EraseFlash.none=Disabled
Inkplate4.menu.EraseFlash.none.upload.erase_cmd=
Inkplate4.menu.EraseFlash.all=Enabled
Inkplate4.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Inkplate4TEMPERA.name=Soldered Inkplate 4 TEMPERA

Inkplate4TEMPERA.bootloader.tool=esptool_py
Inkplate4TEMPERA.bootloader.tool.default=esptool_py

Inkplate4TEMPERA.upload.tool=esptool_py
Inkplate4TEMPERA.upload.tool.default=esptool_py
Inkplate4TEMPERA.upload.tool.network=esp_ota

Inkplate4TEMPERA.upload.maximum_size=1310720
Inkplate4TEMPERA.upload.maximum_data_size=327680
Inkplate4TEMPERA.upload.flags=
Inkplate4TEMPERA.upload.extra_flags=

Inkplate4TEMPERA.serial.disableDTR=true
Inkplate4TEMPERA.serial.disableRTS=true

Inkplate4TEMPERA.build.tarch=xtensa
Inkplate4TEMPERA.build.bootloader_addr=0x1000
Inkplate4TEMPERA.build.target=esp32
Inkplate4TEMPERA.build.mcu=esp32
Inkplate4TEMPERA.build.core=esp32
Inkplate4TEMPERA.build.variant=Inkplate
Inkplate4TEMPERA.build.board=INKPLATE4TEMPERA

Inkplate4TEMPERA.build.f_cpu=240000000L
Inkplate4TEMPERA.build.flash_size=4MB
Inkplate4TEMPERA.build.flash_freq=80m
Inkplate4TEMPERA.build.flash_mode=qio
Inkplate4TEMPERA.build.boot=dio
Inkplate4TEMPERA.build.partitions=default
Inkplate4TEMPERA.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate4TEMPERA.build.extra_libs=

